require './figure.rb'

class Circle < Figure
	attr_accessor :r

	def initialize(name, x, y)
		super
		@r = 10
	end

	def area
		puts "Площадь фигуры '#{name}' составляет: #{(3.141592*(r**2)).round(2)}"
	end

	def circle_length
		puts "Протяженость фигуры '#{name}' составляет: #{(2*3.141592*r).round(2)}"
	end

	def pointIn(a, b)
		if (a-point.x)**2 + (b-point.y)**2 < r**2
			puts "----------------------------------------------------------"
			puts "Точка с координатами (#{a}, #{b}) попадает в заданную окружность..."
			puts "----------------------------------------------------------"
		elsif (a-point.x)**2 + (b-point.y)**2 == r**2
			puts "----------------------------------------------------------"
			puts "Точка с координатами (#{a}, #{b}) лежит на заданной окружности..."
			puts "----------------------------------------------------------"
		else
			puts "----------------------------------------------------------"
			puts "Точка с координатами (#{a}, #{b}) не попадает в заданную окружность..."
			puts "----------------------------------------------------------"
		end
	end

	def properties
		puts
		puts "----------------------СВОЙСТВА ФИГУРЫ '#{name}'---------------------"
		puts
		puts "Координаты точки-центра фигуры '#{name}': (#{point.x}, #{point.y})"
		puts
		puts "Длина радиуса фигуры '#{name}': #{r}"
		puts
		puts area
		puts circle_length
		puts "----------------------------------------------------------"
	end
end



